module PhonebookErrors

/// Ошибка: "Данной записи нет в телефонной книге."
let keyNotFoundError = "Данной записи нет в телефонной книге."

/// Ошибка: "Для записи телефона доступны только символы из алфавита: { 0..9, +, -, (, ) }."
let phoneAlphabetError = "Для записи телефона доступны только символы из алфавита: { 0..9, +, -, (, ) }."

/// Ошибка: "Файл не найден."
let fileNotFoundError = "Файл не найден."

/// Ошибка: "Директория не найдена."
let directoryNotFoundError = "Директория не найдена."